## Imports

In [2]:
import pandas as pd
import numpy as np
import os

## Arquivos na pasta Datasets

In [16]:
base = './../../Datasets/'
arquivos = [arquivo for arquivo in os.listdir(base)]

list(enumerate(arquivos))

[(0, 'world-data-2023-01.csv'),
 (1, 'world-data-2023.csv'),
 (2, 'word-data-2023-01-com-labels.csv'),
 (3, 'populacao_brasileira.csv'),
 (4, 'german_credit_data.csv'),
 (5, 'dataset_valores.txt'),
 (6, 'world-data-2023-01-com-labels.csv'),
 (7, 'diamonds.csv'),
 (8, 'NAs.txt'),
 (9, '2010SitkaAK.csv'),
 (10, '2018WinterOlympics.csv'),
 (11, 'Exercicio_Pandas_3.csv'),
 (12, 'Iris.csv'),
 (13, 'dataset_array.txt'),
 (14, '2010YumaAZ.csv'),
 (15, 'bmw_pricing_challenge.csv'),
 (16, 'heart.csv'),
 (17, 'Mall_Customers.csv'),
 (18, 'Exercicio_Pandas_2.json'),
 (19, 'word-data-2023-01.csv'),
 (20, 'BankChurners.csv'),
 (21, '2010SantaBarbaraCA.csv'),
 (22, 'dataset_valores_vazio.txt'),
 (23, 'wisconsin_breast_cancer.csv'),
 (24, 'Exercicio_Pandas_1.csv'),
 (25, 'dataset_desconfigurado.txt'),
 (26, 'kc_house_data.csv'),
 (27, 'cars.csv')]

## Lendo datasets população do Brasil (time series)

In [17]:
populacao = pd.read_csv(f'{base}/{arquivos[3]}', sep=';')
display(populacao.shape, populacao.head())

(37, 2)

   year  population
0  1980   119011052
1  1981   121154159
2  1982   123774229
3  1983   126403352
4  1984   129025577

## Lendo dados de crédito

In [19]:
credit = pd.read_csv(f'{base}/{arquivos[4]}')
display(arquivos[4], credit.shape, credit.head())

'german_credit_data.csv'

(1000, 10)

,Unnamed: 0,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,0,67,male,2,own,NaN,little,1169,6,radio/TV
1,1,22,female,2,own,little,moderate,5951,48,radio/TV
2,2,49,male,1,own,little,NaN,2096,12,education
3,3,45,male,2,free,little,little,7882,42,furniture/equipment
4,4,53,male,2,free,little,little,4870,24,car

## Leitura de valores a partir de arquivo TXT

In [20]:
valores = pd.read_fwf(f'{base}/{arquivos[5]}', widths=[8, 8, 8])
valores.columns = ['A', 'B', 'C']

display(arquivos[5], valores.shape, valores.head())

'dataset_valores.txt'

(5, 3)

        A       B       C
0  0.4839  0.4536  0.3561
1  0.1292  0.6875  0.6565
2  0.1781  0.3049  0.8928
3  0.7676  0.5801  0.2038
4  0.5993  0.4357  0.7410

## Leitura a partir de txt
* leitura de colunas separadas por tabs

In [21]:
# NAs
nas = pd.read_csv(f'{base}/{arquivos[8]}', sep='\t')
nas = nas.iloc[:,1:]
display(arquivos[8], nas.shape, nas.head())

'NAs.txt'

(10, 3)

          A         B         C
0 -0.166919  0.979728 -0.632955
1 -0.297953 -0.912674 -1.365463
2 -0.120211 -0.540679 -0.680481
3       NaN -2.027325  1.533582
4       NaN       NaN  0.461821

In [22]:
# Arquivos que começam com 2010 e são iguais
for arquivo in arquivos:
    if arquivo.startswith('2010'):
        df = pd.read_csv(f'{base}/{arquivo}')
        display(arquivo, df.shape, df.head())

'2010SitkaAK.csv'

(168, 4)

   LST_DATE      DAY LST_TIME  T_HR_AVG
0  20100601  TUESDAY     0:00      10.5
1  20100601  TUESDAY     1:00      10.5
2  20100601  TUESDAY     2:00      10.0
3  20100601  TUESDAY     3:00       9.7
4  20100601  TUESDAY     4:00       9.4

'2010YumaAZ.csv'

(168, 4)

   LST_DATE      DAY LST_TIME  T_HR_AVG
0  20100601  TUESDAY     0:00      25.2
1  20100601  TUESDAY     1:00      24.1
2  20100601  TUESDAY     2:00      24.4
3  20100601  TUESDAY     3:00      24.9
4  20100601  TUESDAY     4:00      22.8

'2010SantaBarbaraCA.csv'

(168, 4)

   LST_DATE      DAY LST_TIME  T_HR_AVG
0  20100601  TUESDAY     0:00      12.7
1  20100601  TUESDAY     1:00      12.7
2  20100601  TUESDAY     2:00      12.3
3  20100601  TUESDAY     3:00      12.5
4  20100601  TUESDAY     4:00      12.7

In [23]:
# Olympics - 2018WinterOlympics.csv
olympics = pd.read_csv(f'{base}/{arquivos[10]}')
display(arquivos[10], olympics.shape, olympics.head())

'2018WinterOlympics.csv'

(30, 6)

   Rank            NOC  Gold  Silver  Bronze  Total
0     1         Norway    14      14      11     39
1     2        Germany    14      10       7     31
2     3         Canada    11       8      10     29
3     4  United States     9       8       6     23
4     5    Netherlands     8       6       6     20

In [25]:
# Exercicio_Pandas_3.csv
produtos_01 = pd.read_csv(f'{base}/{arquivos[11]}', sep='\t')
display(arquivos[11], produtos_01.shape, produtos_01.head())

'Exercicio_Pandas_3.csv'

(2, 4)

   Produto  Quantidade_Vendida  Valor_Unitario  Valor_Total
0    Mouse                  60              50         3000
1  Teclado                  40             100         4000

In [26]:

iris = pd.read_csv(f'{base}/{arquivos[12]}')
display(arquivos[12], iris.shape, iris.head())

'Iris.csv'

(150, 6)

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [27]:
# data = pd.read_csv(f'{base}/{arquivos[9]}', header=None)
# display(arquivos[9], data.shape, data.head(), data.info())

In [28]:
bmw_pricing_challenge = pd.read_csv(f'{base}/{arquivos[15]}')
display(arquivos[15], bmw_pricing_challenge.shape, bmw_pricing_challenge.head())

'bmw_pricing_challenge.csv'

(4843, 18)

,maker_key,model_key,mileage,engine_power,registration_date,fuel,paint_color,car_type,feature_1,feature_2,feature_3,feature_4,feature_5,feature_6,feature_7,feature_8,price,sold_at
0,BMW,118,140411,100,2012-02-01,diesel,black,convertible,True,True,False,False,True,True,True,False,11300,2018-01-01
1,BMW,M4,13929,317,2016-04-01,petrol,grey,convertible,True,True,False,False,False,True,True,True,69700,2018-02-01
2,BMW,320,183297,120,2012-04-01,diesel,white,convertible,False,False,False,False,True,False,True,False,10200,2018-02-01
3,BMW,420,128035,135,2014-07-01,diesel,red,convertible,True,True,False,False,True,True,True,True,25100,2018-02-01
4,BMW,425,97097,160,2014-12-01,diesel,silver,convertible,True,True,False,False,False,True,True,True,33400,2018-04-01

In [29]:
heart = pd.read_csv(f'{base}/{arquivos[17]}')
display(arquivos[17], heart.shape, heart.head())

'Mall_Customers.csv'

(200, 5)

   CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
0           1    Male   19                  15              39
1           2    Male   21                  15              81
2           3  Female   20                  16               6
3           4  Female   23                  16              77
4           5  Female   31                  17              40

In [30]:
produtos_02 = pd.read_json(f'{base}/{arquivos[18]}')
display(arquivos[18], produtos_02.shape, produtos_02.head())

'Exercicio_Pandas_2.json'

(5, 4)

     Produto  Quantidade_Vendida  Valor_Unitario  Valor_Total
0    Celular                 100            1000       100000
1         TV                  50            2000       100000
2   Notebook                  70            2500       175000
3     Tablet                  30             800        24000
4  Headphone                  80             150        12000

In [32]:
pd.set_option('display.max_columns', None)
bc = pd.read_csv(f'{base}/{arquivos[20]}')
display(arquivos[20], bc.shape, bc.head())

'BankChurners.csv'

(10127, 23)

,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio,Naive_Bayes_Classifier_Attrition_Flag_Card_Category_Contacts_Count_12_mon_Dependent_count_Education_Level_Months_Inactive_12_mon_1,Naive_Bayes_Classifier_Attrition_Flag_Card_Category_Contacts_Count_12_mon_Dependent_count_Education_Level_Months_Inactive_12_mon_2
0,768805383,Existing Customer,45,M,3,High School,Married,$60K - $80K,Blue,39,5,1,3,12691.0,777,11914.0,1.335,1144,42,1.625,0.061,0.000093,0.99991
1,818770008,Existing Customer,49,F,5,Graduate,Single,Less than $40K,Blue,44,6,1,2,8256.0,864,7392.0,1.541,1291,33,3.714,0.105,0.000057,0.99994
2,713982108,Existing Customer,51,M,3,Graduate,Married,$80K - $120K,Blue,36,4,1,0,3418.0,0,3418.0,2.594,1887,20,2.333,0.000,0.000021,0.99998
3,769911858,Existing Customer,40,F,4,High School,Unknown,Less than $40K,Blue,34,3,4,1,3313.0,2517,796.0,1.405,1171,20,2.333,0.760,0.000134,0.99987
4,709106358,Existing Customer,40,M,3,Uneducated,Married,$60K - $80K,Blue,21,5,1,0,4716.0,0,4716.0,2.175,816,28,2.500,0.000,0.000022,0.99998

In [34]:
headers = ['A','B','C']
# sizes = [len(h) for h in headers] # Não funcionou pq os cabeçalhos possuem diferente extensão que as colunas (dados)
sizes = np.full((1,3), 8).tolist()[0]

valores = pd.read_fwf(f'{base}/{arquivos[22]}', widths=sizes, skiprows=1, names=headers)
display(arquivos[22], sizes, valores.shape, valores.head())

'dataset_valores_vazio.txt'

[8, 8, 8]

(6, 3)

          A       B       C
0  A  \t  B       C     NaN
1    0.4839  0.4536  0.3561
2    0.1292  0.6875   Vazio
3    0.1781  0.3049  0.8928
4     Vazio  0.5801  0.2038

In [35]:
headers = ['SITUACAO', 'LOTE', 'DATA', 'NUMERO']
sizes = [12, 2, 15, 10]
desconf = pd.read_fwf(f'{base}/{arquivos[25]}', widths=sizes, names=headers, skiprows=2)
display(arquivos[25], desconf.shape, desconf.head())

'dataset_desconfigurado.txt'

(20, 4)

   SITUACAO  LOTE    DATA      NUMERO
0         1     1  202306  5223103928
1         0     2  202306  5223101250
2         0     3  202306  5223101961
3         0     3  202306  5223109972
4         0     5  202306  5223139983

In [36]:
# kc_house_data.csv
house = pd.read_csv(f'{base}/{arquivos[26]}')
display(arquivos[26], house.shape, house.head())

'kc_house_data.csv'

(21613, 21)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3.0,1.00,1180,5650,1.0,0,0,3,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3.0,2.25,2570,7242,2.0,0,0,3,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2.0,1.00,770,10000,1.0,0,0,3,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4.0,3.00,1960,5000,1.0,0,0,5,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3.0,2.00,1680,8080,1.0,0,0,3,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

In [37]:
pd.read_csv('./../../Datasets/cars.csv')

,Make,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
0,Acura,MDX,SUV,Asia,All,"$36,945","$33,337",3.5,6.0,265,17,23,4451,106,189
1,Acura,RSX Type S 2dr,Sedan,Asia,Front,"$23,820","$21,761",2.0,4.0,200,24,31,2778,101,172
2,Acura,TSX 4dr,Sedan,Asia,Front,"$26,990","$24,647",2.4,4.0,200,22,29,3230,105,183
3,Acura,TL 4dr,Sedan,Asia,Front,"$33,195","$30,299",3.2,6.0,270,20,28,3575,108,186
4,Acura,3.5 RL 4dr,Sedan,Asia,Front,"$43,755","$39,014",3.5,6.0,225,18,24,3880,115,197
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
423,Volvo,C70 LPT convertible 2dr,Sedan,Europe,Front,"$40,565","$38,203",2.4,5.0,197,21,28,3450,105,186
424,Volvo,C70 HPT convertible 2dr,Sedan,Europe,Front,"$42,565","$40,083",2.3,5.0,242,20,26,3450,105,186
425,Volvo,S80 T6 4dr,Sedan,Europe,Front,"$45,210","$42,573",2.9,6.0,268,19,26,3653,110,190
426,Volvo,V40,Wagon,Europe,Front,"$26,135","$24,641",1.9,4.0,170,22,29,2822,101,180
427,Volvo,XC70,Wagon,Europe,All,"$35,145","$33,112",2.5,5.0,208,20,27,3823,109,186

In [38]:
pd.read_csv('./../../Datasets/heart.csv')

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0